# Pandas
Pandas is an open source, BSD-Licensed library providing high proformance, easy-to-use data structures and data analysis tools for the Python programming language.

## Agenda 
- what is Data Frames?
- what is Data Series?
- Different operation in Pandas

In [3]:
# First step is to import Pandas
import pandas as pd
import numpy as np

In [4]:
## Playing with the data frames
df= pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'],columns=["Column1", "Column2","Column3", "Column4"])

In [50]:
df[['Column3','Column4']]

      Column3  Column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [5]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [6]:
df.to_csv('Test.csv')

In [7]:
## Accessing the elements
## 1. .loc  2. iloc

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [8]:
type(df.loc['Row1'])

pandas.core.series.Series

In [12]:
df.iloc[0:,0:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [19]:
df.iloc[2:3,2:3]

      Column3
Row3       10

In [21]:
df.iloc[:,2:3]

      Column3
Row1        2
Row2        6
Row3       10
Row4       14
Row5       18

In [22]:
df.iloc[2:3,:]

      Column1  Column2  Column3  Column4
Row3        8        9       10       11

In [23]:
type(df.iloc[:,:])

pandas.core.frame.DataFrame

In [28]:
df.iloc[0:3,0]

Row1    0
Row2    4
Row3    8
Name: Column1, dtype: int32

In [29]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [30]:
df.iloc[0:3,0:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11

In [31]:
type(df.iloc[0:3,0:])

pandas.core.frame.DataFrame

In [34]:
## Take the elements from the column2
df.iloc[:,1:2]

      Column2
Row1        1
Row2        5
Row3        9
Row4       13
Row5       17

In [35]:
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [36]:
## Convert the Dataframes into arrays
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [37]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [38]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [45]:
df["Column1"].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [47]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])